# Taps
tap "oven-sh/bun"
tap "wallix/awless"
tap "zackriya-solutions/meetily"

# Packages
brew "argocd"
brew "ast-grep"
brew "aws/tap/eks-node-viewer"
brew "awscli"
brew "base64"
brew "btop"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "cocoapods"
brew "codex"
brew "fastly/tap/fastly"
brew "flyctl"
brew "gh"
brew "git-delta"
brew "go"
brew "helm"
brew "httpstat"
brew "jq"
brew "k9s"
brew "libomp"
brew "minikube"
brew "mint"
brew "mkcert"
brew "mtr"
brew "neovim"
brew "node"
brew "nvm"
brew "ollama"
brew "oven-sh/bun/bun"
brew "plow"
brew "pnpm"
brew "pure"
brew "pyenv"
brew "python@3.12"
brew "rbenv"
brew "redis"
brew "uv"
brew "volta"
brew "warrensbox/tap/tfswitch"
brew "watchman"
brew "wimlib"
brew "wrk"
brew "yarn"
brew "zsh-syntax-highlighting"

# Casks
cask "adobe-acrobat-reader"
cask "anaconda"
cask "antigravity"
cask "appcleaner"
cask "arc"
cask "claude-code"
cask "claudia"
cask "cloudflare-warp"
cask "cursor"
cask "datagrip"
cask "dbvisualizer"
cask "docker"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "flipper"
cask "github"
cask "hma-vpn"
cask "hyprnote"
cask "infra"
cask "insomnia"
cask "iterm2"
cask "lens"
cask "lm-studio"
cask "macdown"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "omnidisksweeper"
cask "postman"
cask "proxyman"
cask "sublime-text"
cask "utm"
cask "visual-studio-code"
cask "vnc-viewer"
cask "warp"
cask "webstorm"
cask "zed"
cask "zoom"
